In [1]:
 
# Import the course packages
import pandas as pd
import numpy as np
import datetime as dt
import matplotlib.pyplot as plt
import missingno as msno
import fuzzywuzzy
import recordlinkage 

# Import the course datasets
ride_sharing = pd.read_csv('../datasets/ride_sharing_new.csv', index_col = 'Unnamed: 0')
airlines = pd.read_csv('../datasets/airlines_final.csv',  index_col = 'Unnamed: 0')
banking = pd.read_csv('../datasets/banking_dirty.csv', index_col = 'Unnamed: 0')
restaurants = pd.read_csv('../datasets/restaurants_L2.csv', index_col = 'Unnamed: 0')
restaurants_new = pd.read_csv('../datasets/restaurants_L2_dirty.csv', index_col = 'Unnamed: 0')

In [6]:
a  =  ride_sharing
a.value_counts

<bound method DataFrame.value_counts of          duration  station_A_id  \
0      12 minutes            81
1      24 minutes             3
2       8 minutes            67
3       4 minutes            16
4      11 minutes            22
...           ...           ...
25755  11 minutes            15
25756  10 minutes            15
25757  14 minutes            15
25758  14 minutes            15
25759  29 minutes            16

                                          station_A_name  station_B_id  \
0                                     Berry St at 4th St           323
1           Powell St BART Station (Market St at 4th St)           118
2      San Francisco Caltrain Station 2  (Townsend St...            23
3                                Steuart St at Market St            28
4                                  Howard St at Beale St           350
...                                                  ...           ...
25755  San Francisco Ferry Building (Harry Bridges Pl...            34
25756  San Francisco Ferry Building (Harry Bridges Pl...            34
25757  San Francisco Ferry Building (Harry Bridges Pl...            42
25758  San Francisco Ferry Building (Harry Bridges Pl...            42
25759                            Steuart St at Market St           115

                                      station_B_name  bike_id  user_type  \
0                                 Broadway at Kearny     5480          2
1                    Eureka Valley Recreation Center     5193          2
2                      The Embarcadero at Steuart St     3652          3
3                       The Embarcadero at Bryant St     1883          1
4                               8th St at Brannan St     4626          2
...                                              ...      ...        ...
25755                 Father Alfred E Boeddeker Park     5063          1
25756                 Father Alfred E Boeddeker Park     5411          2
25757  San Francisco City Hall (Polk St at Grove St)     5157          2
25758  San Francisco City Hall (Polk St at Grove St)     4438          2
25759                             Jackson Playground     1705          3

       user_birth_year user_gender
0                 1959        Male
1                 1965        Male
2                 1993        Male
3                 1979        Male
4                 1994        Male
...                ...         ...
25755             2000        Male
25756             1998        Male
25757             1995        Male
25758             1995        Male
25759             1990        Male

[25760 rows x 9 columns]>

In [11]:
###########

In [15]:
a=["KARAM",'Karam','ALI','Ali','ali' ,"OMAR" ,'SANAD' ,'AMER','ZAID' ,"Zaid" ,'zaid' ,'omaR',"Sanad"]
nsa =pd.DataFrame({"name" : a})

In [16]:
nsa

     name
0   KARAM
1   Karam
2     ALI
3     Ali
4     ali
5    OMAR
6   SANAD
7    AMER
8    ZAID
9    Zaid
10   zaid
11   omaR
12  Sanad

In [19]:
nsa.value_counts()

name
ALI      1
AMER     1
Ali      1
KARAM    1
Karam    1
OMAR     1
SANAD    1
Sanad    1
ZAID     1
Zaid     1
ali      1
omaR     1
zaid     1
dtype: int64

In [25]:
nsa2 = nsa['name'].str.lower()

In [26]:
nsa2.value_counts()

ali      3
zaid     3
karam    2
omar     2
sanad    2
amer     1
Name: name, dtype: int64